TOKEN = "vk1.a.4NLW0LW3cobhYjBFzUQ1uvIF8Zn93a7G9W--YJ-URTkk9tf9Qt7TCXYFGv1pQ-o17M_1oRUhJMEV53edLMcBKwIB9F3JIRJl-Vi0YXAAT26pOvv3_XY5Yc6wj6PQmt8p2BVheWDb4GKoIsjBkTT9pyVWWTK3qv0LZwZJv7FOFqczW5BAc7X9Hub2eaYgeWt9txSLeBYlbB-MiTG47JBKkQ"
PREFIX = "."
ROLES = ["Хелпер-Стажёр", "Хелпер", "Модератор", "Администратор", "Гл. Администратор"]
LOG_PEER_ID = 2000000005

RULES = {
    "1": {"name": "Противный контент / Порнография", "emoji": "🔞", "triggers": ["порно", "порнуха", "хентай", "cp", "нсфв", "nsfw"], "punishment": "бан", "iris_cmd": "!бан"},
    "2": {"name": "Пропаганда незаконного", "emoji": "💊", "triggers": ["нарко", "купи закладочку", "взлом", "софт на вк"], "punishment": "бан", "iris_cmd": "!бан"},
    "3": {"name": "Любой пиар / Ссылки", "emoji": "📢", "triggers": ["vk.me/", "://vk.com", "t.me/", "заходи в группу"], "punishment": "бан", "iris_cmd": "!бан"},
    "4": {"name": "Помеха общению / игре", "emoji": "♻️", "triggers": ["спамспам", "флудфлуд", "ааааааааааа"], "punishment": "мут 1 день", "iris_cmd": "!мут 1 д"},
    "5": {"name": "Затрагивание родных", "emoji": "👪", "triggers": ["мать", "мамка", "отец", "батя", "мк", "mq"], "punishment": "мут 1 день", "iris_cmd": "!мут 1 д"},
    "6": {"name": "Политика", "emoji": "🏛️", "triggers": ["путин", "зеленский", "сво", "война", "нато", "сша"], "punishment": "мут 1 день", "iris_cmd": "!мут 1 д"},
    "6.1": {"name": "Ультранационализм", "emoji": "🚫", "triggers": ["хохол", "москаль", "чурка", "негр", "свастика"], "punishment": "бан", "iris_cmd": "!бан"},
    "7": {"name": "Вызов модераторов без причины", "emoji": "🔔", "triggers": ["@online", "@all", "модеры сюда", "админы чек чат"], "punishment": "предупреждение", "iris_cmd": "!варн"},
    "8": {"name": "Страничные боты в негативных целях", "emoji": "🤖", "triggers": ["рейд бота", "запуск скрипта", "спам-бот", "рейд беседы"], "punishment": "бан", "iris_cmd": "!бан"},
    "11": {"name": "Призыв не играть в бота Нищего", "emoji": "🛑", "triggers": ["не играйте в нищего", "нищий говно", "уходите из нищего"], "punishment": "мут 3 дня", "iris_cmd": "!мут 3 д"},
    "12": {"name": "Упоминание разработчиков", "emoji": "💻", "triggers": ["разраб", "создатель бота", "овнер", "разработчик"], "punishment": "предупреждение", "iris_cmd": "!варн"}
}
HELP_TEXT = "📖 **СПИСОК ВСЕХ КОМАНД MD-tools** 📖\n━━━━━━━━━━━━━━━━━━━━━\n• {p}peerid — узнать ID чата\n• {p}setlog — привязать Лог-чат\n• {p}чат [Название] — привязать имя чата\n• {p}должность [Название] — выбрать роль\n• {p}помощь — открыть меню"

